---
kind: other
id: Properties.T:Autodesk.Revit.DB.DetailArc
source: html/3b906f62-4f90-9fa8-815d-bc54d43c8a13.htm
---
# DetailArc Properties

The id of the assembly instance to which the element belongs.